src/BusinessProcesses/КонтрольПамяти/КонтрольПамяти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КонтрольПамяти</name>
  <task>Task.ЗадачаОтветственному</task>
  <attributes>
    <name>ОтветственныйЗаВыполнение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/ПараметрыКластеров/ПараметрыКластеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластеров</name>
  <resources>
    <name>ТипПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЗапускаСервераАдминистрирования</name>
    <comment>// Только для &quot;RAС&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортАгентаКластера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КластерОбъектаКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПерезапускаРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйОбъемПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалДопустимогоПревышенияОбъемаПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонениеОшибокСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринудительноЗавершатьПроблемныеПроцессы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыключенныеПроцессыОстанавливатьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОтказоустойчивости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимРаспределенияНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БезопасноеХранилище/БезопасноеХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилище</name>
  <resources>
    <name>ДанныеХранилища</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецХранилища</name>
    <type>
      <types>CatalogRef.НастройкиАнализаПроблемПроизводительности</types>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>String</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПамяти/НастройкиКонтрольПамяти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПамяти</name>
  <resources>
    <name>ПороговаяПамятьМБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОповещенияОЗависшихСеансахСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьЗаписиСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <comment>0 - Не мониторить, 1 - мониторить при превышении, 2 - мониторить всегда</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/BusinessProcesses/КонтрольПамяти/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Общие настройки
Перем ТекстОшибки;
Перем ЗадачаОшибкаПриАнализе;
Перем ОбязательныеНастройки;
Перем НетПроблем;
Перем ИмяСтраницыСправки;

// Настройки контрольной процедуры
Перем ТипПодключения;
Перем АдресСервераАдминистрирования;
Перем ПортСервераАдминистрирования;
Перем АдресЦентральногоСервера;
Перем ПортКластера;
Перем ПортАгентаКластера;
Перем АдминистраторКластера;
Перем ПарольАдминистратораКластера;
Перем ПороговаяПамятьМБ;
Перем ПериодЧастогоОпросаСервера;
Перем ДатаОповещенияОЗависшихСеансах;
Перем АвтоматическиУдалятьЗаписиСеансов;
Перем СрокХраненияДанных;
Перем ВерсияПлатформы;
Перем КаталогЗапускаСервераАдминистрирования;

//////////////////////
// Общие функции
//////////////////////



Процедура ПроверкаНаНаличиеОшибокВыполнения(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ТекстОшибки <> Неопределено;
КонецПроцедуры

Процедура КонтрольнаяПроцедураЗавершенаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = НЕ КонтрольнаяПроцедура.Выполнять;
КонецПроцедуры

//////////////////
// Разбор Настроек
//////////////////

Процедура ЕстьНезаполненныеНастройкиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Ошибки = Новый Массив;
	Для Каждого Настройка Из ОбязательныеНастройки Цикл		
		Если НЕ ЗначениеЗаполнено(Настройка.Значение) Тогда
			Ошибки.Добавить(Настройка.Ключ);
		КонецЕсли;
	КонецЦикла;	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = "В контролируемом кластере не определены следующие настройки: "; 	
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - " + ОбщийКлиентСервер.ОбъединитьСтроку(Ошибки, Символы.ПС + " - ");
		Результат = Истина;
		ИмяСтраницыСправки = "НеЗаполненыНастройкиВОбъектеКонтроля";

	Иначе	
		Результат = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Процедура РазобратьНастройкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	ТекстОшибки = Неопределено;
	Попытка
		РазобратьНастройки();
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСтраницыСправки = "НеизвестнаяОшибка";
		Отладка.Ошибка(ТекстОшибки);
		
	КонецПопытки;
КонецПроцедуры

Процедура РазобратьНастройки()
	ОбязательныеНастройки = Новый Соответствие;
	
	// Чтение настроек
	НастройкиСловарь = РегистрыСведений.ПараметрыКластеров.Получить(Новый Структура("ОбъектКонтроля", КонтрольнаяПроцедура.ОбъектКонтроля));
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеХранилища = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(КонтрольнаяПроцедура.ОбъектКонтроля);
	НастройкиСловарь.Вставить("АдминистраторКластера", ДанныеХранилища.АдминистраторКластера);
	НастройкиСловарь.Вставить("ПарольАдминистратораКластера", ДанныеХранилища.ПарольАдминистратораКластера);
	УстановитьПривилегированныйРежим(Ложь);
	
	ТипПодключения = НастройкиСловарь.ТипПодключения; 
	ОбязательныеНастройки.Вставить("Тип подключения", ТипПодключения);

	АдресСервераАдминистрирования = НастройкиСловарь.АдресСервераАдминистрирования;
	ПортСервераАдминистрирования = НастройкиСловарь.ПортСервераАдминистрирования; 
	КаталогЗапускаСервераАдминистрирования = НастройкиСловарь.КаталогЗапускаСервераАдминистрирования; 	
	АдресЦентральногоСервера = НастройкиСловарь.АдресКластера;
	ПортАгентаКластера = НастройкиСловарь.ПортАгентаКластера;
	ВерсияПлатформы = НастройкиСловарь.ВерсияПлатформы;
		
	ПортКластера = НастройкиСловарь.ПортКластера;
	ОбязательныеНастройки.Вставить("номер основного IP порта менеджера кластера", ПортКластера);
		
	ПериодЧастогоОпросаСервера = 5;
	
	АдминистраторКластера = НастройкиСловарь.АдминистраторКластера;
	ПарольАдминистратораКластера = НастройкиСловарь.ПарольАдминистратораКластера;
	
	ЧастныеНастройкиСловарь = РегистрыСведений.НастройкиКонтрольПамяти.Получить(
		Новый Структура("КонтрольнаяПроцедура", КонтрольнаяПроцедура)
	);
	
	ПороговаяПамятьМБ = ЧастныеНастройкиСловарь.ПороговаяПамятьМб;
	ДатаОповещенияОЗависшихСеансах = ЧастныеНастройкиСловарь.ДатаОповещенияОЗависшихСеансахСкрыто;
	АвтоматическиУдалятьЗаписиСеансов = ЧастныеНастройкиСловарь.АвтоматическиУдалятьЗаписиСеансов;
	СрокХраненияДанных = ЧастныеНастройкиСловарь.СрокХраненияДанных;
	
КонецПроцедуры


/////////////////////
// Формирование задач
/////////////////////

Функция СоздатьЗадачуОтветственномуЗаВыполнение(ТекстПоручения)
	
	Возврат Неопределено;
	
КонецФункции	

Процедура СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса)
	ФормируемыеЗадачи.Очистить();		
	
	ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
	Если ЗадачаОбъект.БизнесПроцесс = Неопределено И ЗадачаОбъект.ТочкаМаршрута = Неопределено Тогда 
		БизнесПроцессСервер.ПривязатьЗадачуКТочкеМаршрута(ЭтотОбъект.Ссылка, ЗадачаОбъект, ТочкаМаршрутаБизнесПроцесса);	
	КонецЕсли;
	ЗадачаОбъект.Выполнена = Ложь;
	ФормируемыеЗадачи.Добавить(ЗадачаОбъект);
	
КонецПроцедуры	

Процедура УстранитьПричиныНевозможностиАнализаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗадачаОшибкаПриАнализе = СоздатьЗадачуОтветственномуЗаВыполнение(ТекстОшибки);
	СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаОшибкаПриАнализе, ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура НачатьПроверкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗадачаПоПерезапуску = БизнесПроцессСервер.НайтиЗадачуПерезапуска(ЭтотОбъект.Ссылка);
	СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаПоПерезапуску, ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

////////////////////////
// Анализ
////////////////////////

Процедура ВыполнитьАнализОбработка(ТочкаМаршрутаБизнесПроцесса)
	ТекстОшибки = Неопределено;
	Попытка 
		ВыполнитьАнализ();
	Исключение
		
		НетПроблем = Неопределено;
		ИмяСтраницыСправки = "НеизвестнаяОшибка";
		Сообщение = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отладка.Ошибка(Сообщение);
		СоздатьЗадачуОтветственномуЗаВыполнение(Сообщение);
		
	КонецПопытки;

КонецПроцедуры	

Процедура ВыполнитьАнализ()
КонецПроцедуры

#КонецЕсли
